In [1]:
import numpy as np

In [72]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
x = Series([10,20,30,40,50])

In [4]:
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# if numerical index, tells us the range = start, stop, step

In [7]:
# access values:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [9]:
# accessing data type
x.dtype

dtype('int64')

In [11]:
# diff data types
x = Series([10,20,30,40,'str'])
x

0     10
1     20
2     30
3     40
4    str
dtype: object

In [43]:
# changed everything to object type, no longer int64 type
# same if using a float, all stored as floats
# will do this as long as everything can be stored as the same data type, because they are homogenous

In [18]:
# creating an index
data = [450, 650, 870]
Sales = Series(data, index=['Rachel', 'Mark', 'Victor'])
Sales.index
# can use Sales.index to check the index of the series

Index(['Rachel', 'Mark', 'Victor'], dtype='object')

In [17]:
type(Sales)
# shows that this is a series

pandas.core.series.Series

In [23]:
# accessing index
Sales.index[0]

'Rachel'

In [22]:
# accessing values relative to an index
Sales['Rachel']

450

In [24]:
# booleans
Sales>500

Rachel    False
Mark       True
Victor     True
dtype: bool

In [25]:
# output booleans of whether things were true or false

In [26]:
# we can filter on booleans
Sales[[False, True, True]]

Mark      650
Victor    870
dtype: int64

In [27]:
# using filters as an argument
Sales[Sales>500]

Mark      650
Victor    870
dtype: int64

In [30]:
# this did the same thing as the False, true, true code, but much quicker

In [31]:
'Mark' in Sales

True

In [32]:
'Adam' in Sales

False

In [33]:
# so mark = ture, because he is in the index, but adam isnt and is false

In [36]:
650 in Sales
# returns false, only checking the index, not the values

False

In [38]:
# like a dictionary
# very easy to transform series to dictionaries and vice versa
sales_dict = Sales.to_dict()
sales_dict
# now this is a dictionary

{'Rachel': 450, 'Mark': 650, 'Victor': 870}

In [41]:
# converting back to dictionary
sales_ser = Series(sales_dict)
sales_ser

Rachel    450
Mark      650
Victor    870
dtype: int64

In [44]:
# very, very easy to convert!!

In [49]:
# adding entries
new_sales = Series(Sales, index=['Thu', 'Mark', 'Rachel', 'Victor', 'Adam'])
# must add things with a vlaue, or they will have NaN
# NaN = Not a Number ( similar to NULL)
new_sales

# data type now float, NaN, considered as a float value

Thu         NaN
Mark      650.0
Rachel    450.0
Victor    870.0
Adam        NaN
dtype: float64

In [50]:
# NaN is different to none, but we can filter on Nan
np.isnan(new_sales['Thu'])

True

In [51]:
new_sales['Thu'] is None
# showing that none is diff to NaN

False

In [52]:
#checking if all values are NaN
np.isnan(new_sales)

Thu        True
Mark      False
Rachel    False
Victor    False
Adam       True
dtype: bool

In [55]:
# pandas can check for NULL values too
pd.isnull(new_sales)

#same as np.isnan

Thu        True
Mark      False
Rachel    False
Victor    False
Adam       True
dtype: bool

In [56]:
new_sales

Thu         NaN
Mark      650.0
Rachel    450.0
Victor    870.0
Adam        NaN
dtype: float64

In [57]:
# index and series do not have names, which is not good

In [63]:
# change index name
new_sales.index.name = 'Sales Person'
new_sales

Sales Person
Thu         NaN
Mark      650.0
Rachel    450.0
Victor    870.0
Adam        NaN
Name: Chocolate Sales, dtype: float64

In [64]:
# change values name
new_sales.name = 'Chocolate Sales'
new_sales

Sales Person
Thu         NaN
Mark      650.0
Rachel    450.0
Victor    870.0
Adam        NaN
Name: Chocolate Sales, dtype: float64

In [65]:
# series are 1-dimensional (1D)
# dataframes are 2-dimendional (2D) and contain labelled axes

In [73]:
# creating a data frame

# a list of lists
data = [[ 'Sally', 20], ['Beth', 30], ['Bob', 50]]

df = DataFrame(data, columns=['Name', 'Age'])
df

    Name  Age
0  Sally   20
1   Beth   30
2    Bob   50

In [76]:
# data frame created from a dictionary

new_dict = {'Name': ['Sally', 'Beth', 'Bob'], 'Age': [20, 30, 50]}

df_dict = DataFrame(new_dict)
df

    Name  Age
0  Sally   20
1   Beth   30
2    Bob   50

In [77]:
# the list of lists and dictionary created the same 2d array
# the dictonary did not require additional instructions on what the column names were

In [79]:
# dictionary list

dict_list = [{'Name': 'Sally', 'Age': 20}, {'Name': 'Beth', 'Age':30}, {'Name':'Bob', 'Age':50}]

df_dict_list = DataFrame(dict_list)

df_dict_list

    Name  Age
0  Sally   20
1   Beth   30
2    Bob   50

In [80]:
# still returned the same formated 2D array

In [82]:
# shifting and changing the index
# can set teh index to name instead of 0,1,2
# use set_index(Name)

# can use reindex to reset
#   lots of NaNs is the index was not present originally though

In [88]:
# removing NaN values

# creating them first, making a data fram from a series
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])

df_region = DataFrame({'East':east, 'West':west})
df_region
# an Nan is visible in east because west had en extra value to east

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [89]:
#added columns
df_region['North'] = [2000,3000,2500,4000]
df_region['South'] = [1500,2000,1500,4000]

df_region

      East  West  North  South
Q1  1000.0  1100   2000   1500
Q2  1200.0  1300   3000   2000
Q3  3400.0  2400   2500   1500
Q4     NaN  3500   4000   4000

In [96]:
new_df = df_region.reindex(['Q0', 'Q1', 'Q2', 'Q3', 'Q4', 'Q5', 'Q6'])
new_df

# reindex shifted the data relative the the index we already had, + the new ones

      East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     NaN  3500.0  4000.0  4000.0
Q5     NaN     NaN     NaN     NaN
Q6     NaN     NaN     NaN     NaN

In [97]:
# diff NaN data cleaning

# from first week: drop, immute, hot-deck, flag

# replacing with a value, here:0
new_df.fillna(0)

      East    West   North   South
Q0     0.0     0.0     0.0     0.0
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     0.0  3500.0  4000.0  4000.0
Q5     0.0     0.0     0.0     0.0
Q6     0.0     0.0     0.0     0.0

In [98]:
new_df
# no 0s, because the change was not assigned
# good because we can keep raw data and create new objects of cleaned data

      East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     NaN  3500.0  4000.0  4000.0
Q5     NaN     NaN     NaN     NaN
Q6     NaN     NaN     NaN     NaN

In [102]:
#bfill, ffill, pad, 

new_df.fillna(method='ffill')
# taking form the top and filling down

# bfill = opposite, bottom filling upwards

      East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4  3400.0  3500.0  4000.0  4000.0
Q5  3400.0  3500.0  4000.0  4000.0
Q6  3400.0  3500.0  4000.0  4000.0

In [103]:
# interpolation

new_df.interpolate()

# top row = NaN completely, so no values still
# diff to ffill, as it will fill top values if at least one top value is present

      East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4  3400.0  3500.0  4000.0  4000.0
Q5  3400.0  3500.0  4000.0  4000.0
Q6  3400.0  3500.0  4000.0  4000.0

In [104]:
# drop Nans

new_df.dropna()

#dropped any rows with any NaNs

      East    West   North   South
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0

In [106]:
# we can specify how many NaNs we want to accept

new_df.dropna(axis=0, thresh=1)

#axis 1 = columns
# axis 0 = rows (default)

# thresh = threshold = how many non NaN values need to be in that row for the row to be dropped

      East    West   North   South
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     NaN  3500.0  4000.0  4000.0

In [110]:
new_df.dropna(thresh = 0)
# none are dropped

      East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     NaN  3500.0  4000.0  4000.0
Q5     NaN     NaN     NaN     NaN
Q6     NaN     NaN     NaN     NaN

In [108]:
new_df.dropna(thresh = 4)

      East    West   North   South
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0

In [109]:
# now the final one from thresh=1 was dropped (we specified that we wanted 4 non-NaN values)

In [112]:
# dealing with duplicate rows:

# .duplicated = boolean output, duplicate rows below the original/unnique row = True
#     then , dropduplicates removes the duplicated rows

In [113]:
new_df['North']
#returns the row like a series

Q0       NaN
Q1    2000.0
Q2    3000.0
Q3    2500.0
Q4    4000.0
Q5       NaN
Q6       NaN
Name: North, dtype: float64

In [114]:
#iloc = index location
#   find record based on integer indexing

new_df.iloc[2]

# working from row index location

# returned the Q2 values for all columns

East     1200.0
West     1300.0
North    3000.0
South    2000.0
Name: Q2, dtype: float64

In [116]:
# finding specific values

# e.g. Q2 West

new_df.iloc[2]['West']

#or 

new_df.iloc[2,1]

1300.0

In [118]:
# slicing

new_df.iloc[1:3]

# selected Q1 and Q2
#   returned row index 1 and 2, beacause 3 is non-inclusive

      East    West   North   South
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0

In [120]:
# getting values using labels/boolean arrays

new_df.loc['Q3']

# returned all values for Q3

East     3400.0
West     2400.0
North    2500.0
South    1500.0
Name: Q3, dtype: float64

In [121]:
# built in methods

new_df.describe

# summary stats

<bound method NDFrame.describe of       East    West   North   South
Q0     NaN     NaN     NaN     NaN
Q1  1000.0  1100.0  2000.0  1500.0
Q2  1200.0  1300.0  3000.0  2000.0
Q3  3400.0  2400.0  2500.0  1500.0
Q4     NaN  3500.0  4000.0  4000.0
Q5     NaN     NaN     NaN     NaN
Q6     NaN     NaN     NaN     NaN>

In [123]:
new_df.sum()
# gives the sums for each column

# also: min, max, average etc....

# just google the function you want

East      5600.0
West      8300.0
North    11500.0
South     9000.0
dtype: float64